const all = {
	// namespaced: true, // 命名空间,
	state: {
		repeattime: 3000, // 点击按钮请求时间
		// 所有订单状态
		orderStatusObj: {
			0: '待接单',
			1: '待揽件',
			2: '待付款',
			3: '待发货',
			4: '配载中',
			5: '运输中',
			6: '待签收',
			7: '已签收',
			8: '已取消',
			9: '被拒绝',
			10: '接单超时',
			11: '揽件超时',
			12: '异常终止'
		},
		// 所有订单状态 颜色
		orderStatusColorObj: {
			0: '',
			1: '',
			2: '',
			3: '',
			4: '',
			5: '',
			6: '',
			7: '',
			8: '',
			9: '',
			10: 'colorRed',
			11: 'colorRed',
			12: 'colorRed'
		},
		// 所有订单删除按钮显示
		orderDeleteObj: {
			0: 0,
			1: 0,
			2: 0,
			3: 0,
			4: 0,
			5: 0,
			6: 0,
			7: 1,
			8: 1,
			9: 1,
			10: 1,
			11: 1,
			12: 1
		},
		lawTypeObj: {
			1: '拉拉队用户服务协议',
			2: '支付服务协议',
			3: '拉拉队隐私政策',
			4: '拉拉队寄件服务条款'
		},
	},
	mutations: {

	}
};

export default all;
